package consultation23;

import java.util.List;

public class Task2 {
    /**
     * Задача: Найти сумму неуникальных чисел в списке.
     * <p>
     * Описание:
     * Нужно реализовать метод, который принимает список целых чисел и возвращает сумму чисел, которые встречаются
     * более одного раза в списке (неуникальных чисел).
     * <p>
     * Например:
     * <p>
     * Пример 1:  <p>
     * Вход: [1, 2, 2, 3, 4, 4, 5]  <p>
     * Выход: 12  <p>
     * Объяснение: Неуникальные числа — 2 и 4. Сумма 2 + 2 + 4 + 4 = 12.  <p>
     * <p>
     * Пример 2:  <p>
     * Вход: [7, 7, 7, 7]  <p>
     * Выход: 28  <p>
     * Объяснение: Неуникальное число — 7, сумма 7 + 7 + 7 + 7 = 28.  <p>
     * <p>
     * Пример 3:  <p>
     * Вход: [1, 2, 3, 4]  <p>
     * Выход: 0  <p>
     * Объяснение: В списке нет неуникальных чисел, поэтому результат 0. <p>
     * <p>
     * Пример 4:  <p>
     * Вход: []  <p>
     * Выход: 0  <p>

     * Объяснение: Пустой список, нет чисел для анализа, результат 0.  <p>
     *  <p>
     * Метод должен быть определён следующим образом:  <p>
     * <p>
     * public static int sumOfNonUniqueNumbers(List<Integer> numbers)
     * <p>
     * @param numbers список целых чисел  <p>
     * @return сумма неуникальных чисел в списке  <p>
     */

    public static int sumOfNonUniqueNumbers(List<Integer> numbers) {
        int sum = 0;

        return sum;
    }

}
